<?php

require_once dirname(__FILE__) . '/../lib/ExternalApi/ApiBetaPro.php';
require_once dirname(__FILE__) . '/../lib/ExternalApi/ApiKetKz.php';

define('ACTIVE_DELIVERY_ID', 2); // 1-Logos, 2-BetaPro

define('PRICE_KOEF_KZ', 5.7);
define('PRICE_KOEF_KZG', 1.4);
define('PRICE_KOEF_RU', 1);

define('PRICE_KOEF_DELIVERY_KZ', 5.6);
define('PRICE_KOEF_DELIVERY_KZG', 1.4);
define('PRICE_KOEF_DELIVERY_RU', 1);


$configs = array();
/**
 * Courier phone numbers
 * included in:
 * /handlers/sendCourierDeliveryEmail.php
 * /handlers/sendCourierDeliverySMS.php
 * @var array
 */
$configs["courier_numbers"] = array(
    'Костанай курьер' => '87781637009^87759150319',
    'Астана Курьер' => '87754845993^87071349334',
    'Караганды курьер' => '87758549172^87015525673',
    'Талдыкорган курьер' => '87758549172^87015525673',
    'Алматы курьер' => '87781637009^87759150319',
    'Петропавловск курьер' => '87758549172^87015525673',
    'Кокшетау курьер' => '87781637009^87759150319',
    'Жезказган курьер' => '87754845993^87071349334',
    'Кызыл-Орда курьер' => '87758549172^87015525673',
    'Атырау курьер' => '87758549172^87015525673',
    'Актау курьер' => '87758549172^87015525673',
    'Семипалатинск курьер' => '87758549172^87015525673',
    'Темиртау курьер' => '87781637009^87759150319',
    'Кульсары курьер' => '87754845993^87071349334',
    'Павлодар курьер' => '87781637009^87759150319',
    'Жанаозен курьер' => '87781637009^87759150319',
    'Туркестан курьер' => '87754845993^87071349334',
    'Шымкент курьер' => '87754845993^87071349334',
    'Актобе курьер' => '87758549172^87015525673',
    'Усть-Каменогорск курьер' => '87758549172^87015525673',
    'Экибастуз курьер' => '87758549172^87015525673',
    'Уральск курьер' => '87754845993^87071349334',
    'Тараз курьер' => '87758549172^87015525673',
);

/**
 * Delivery SMS numbers
 * included in:
 * /handlers/set_menu_obzvon.php
 * /handlers/set_menu_obzvon.php
 * @var array
 */
$configs["delivery_sms"] = array(
    'Костанай курьер' => '87781637009',
    'Астана Курьер' => '87059240370',
    'Караганды курьер' => '87758549172',
    'Талдыкорган курьер' => '87758549172',
    'Алматы курьер' => '87781637009',
    'Петропавловск курьер' => '87758549172',
    'Кокшетау курьер' => '87781637009',
    'Жезказган курьер' => '87059240370',
    'Кызыл-Орда курьер' => '87758549172',
    'Атырау курьер' => '87758549172',
    'Актау курьер' => '87758549172',
    'Семипалатинск курьер' => '87758549172',
    'Темиртау курьер' => '87781637009',
    'Павлодар курьер' => '87781637009',
    'Жанаозен курьер' => '87781637009',
    'Туркестан курьер' => '87059240370',
    'Шымкент курьер' => '87059240370',
    'Актобе курьер' => '87758549172',
    'Усть-Каменогорск курьер' => '87758549172',
    'Экибастуз курьер' => '87758549172',
    'Уральск курьер' => '87059240370',
    'Тараз курьер' => '87758549172',
);
